---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtStartSchedulesTagsFilters
source: html/28b71d2e-e8c0-ce81-7a7e-0d791478a868.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtStartSchedulesTagsFilters Property

"Hook Rotation At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookRotationAtStartSchedulesTagsFilters { get; }
```